БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЗаключенияПоДействиямМедосмотра/ЗаключенияПоДействиямМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаключенияПоДействиямМедосмотра</name>
  <resources>
    <name>Заключение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>CatalogRef.ДействияМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеМедОсмотра</name>
    <type>
      <types>DocumentRef.ПрохождениеМедосмотра</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/ПрохождениеМедосмотра/ПрохождениеМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеМедосмотра</name>
  <registerRecords>InformationRegister.НаправленияПоРезультатамМедосмотра</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедКомиссии</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокНаПрохождениеМедосмотра</name>
    <type>
      <types>DocumentRef.СписокНаПрохождениеМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВПроведенииДопОбследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВОбследованииВЦентреПрофпатологии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВАмбулаторномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСтационарномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСанаторноКурортномЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВДиспансерномНаблюдении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВЛечебноПрофилактическомПитании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВНаправленииНаМедикоСоциальнуюЭкспертизу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтойкаяУтратаТрудоспособности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДиспансернаяГруппа</name>
    <type>
      <types>EnumRef.ГруппыЗдоровья</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМедосмотра</name>
    <type>
      <types>EnumRef.ТипыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещениеОПредварительномДиагнозеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещениеОПредварительномДиагнозеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исследования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Осмотр</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКарта</name>
    <type>
      <types>CatalogRef.МедицинскиеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрохожденияМО</name>
    <type>
      <types>EnumRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьГруппаЗдоровья</name>
    <comment>(используется реквизит ДиспансернаяГруппа)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВАрхиве</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеРЭМД</name>
    <type>
      <types>CatalogRef.СообщенияРЭМД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКлиента</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦехУчасток</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Профессия</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тестовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <comment>Условия обслуживания по медосмотру в рамках договора с контрагентом</comment>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМО</name>
    <type>
      <types>CatalogRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОПрививках</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфекционныйАнамнез</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКЗаключению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияМедосмотра</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенДополнительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КритичныеПротивопоказания</name>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Диагнозы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДетализацияДиагноза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УточненностьДиагноза</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактерЗаболевания</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>Профессиональное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленВпервые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофнепригодностьВременная</name>
      <type>
        <types>EnumRef.ХарактерПрофнепригодности</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеФакторыПротивопоказаний</name>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФакторыИУсловияРаботы</name>
    <attributes>
      <name>Фактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПриема</name>
    <comment>Используется только для справок и прочих медосмотров. Не используется для периодических медосмотров работников</comment>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиИПодписиЭМД</name>
    <attributes>
      <name>УИД_ЭМД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_ЭЦП</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьМинздрава</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭМД</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭМД</name>
      <type>
        <types>CatalogRef.ШаблоныHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаЭМД</name>
      <type>
        <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКФайлуВАрхиве</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеРЭМД</name>
      <type>
        <types>CatalogRef.СообщенияРЭМД</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриказВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
        <types>CatalogRef.ПриказыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_Шаблона</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИдентификаторыПриказов</name>
    <attributes>
      <name>ПриказВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
        <types>CatalogRef.ПриказыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЗаключенияПоДействиямМедосмотра/Forms/ЗаключенияМедосмотра/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ПрохождениеМедосмотра)
		Или ТипЗнч(Параметры.Действия) <> Тип("Массив")
		Или Параметры.Действия.Количество() = 0
	Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПрохождениеМедОсмотра = Параметры.ПрохождениеМедосмотра;
	ЗаполнитьТаблицуДействий(Параметры.Действия);
	
	Если ПрохождениеМедОсмотра.ПодписанЭП Тогда
		Элементы.ДействияМедОсмотра.ТолькоПросмотр = Истина;
		Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередЗакрытиемМодифицированнойФормы", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействияМедОсмотра

&НаКлиенте
Процедура ДействияМедОсмотраЗаключениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДействияМедОсмотра.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Заключение) Тогда
		Элементы.ДействияМедОсмотра.ТекущиеДанные.Заключение = ТекДанные.ЗаключениеПоУмолчанию;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИЗакрытьНаСервере(ПрохождениеМедОсмотра, ДействияМедОсмотра);
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьИЗакрытьНаСервере(Знач ПрохождениеМедОсмотра, Знач ДействияМедОсмотра)
	
	НачатьТранзакцию();
	
	МенеджерЗаписи = РегистрыСведений.ЗаключенияПоДействиямМедосмотра.СоздатьМенеджерЗаписи();
	Для Каждого СтрокаДействия Из ДействияМедОсмотра Цикл
		Действие = СтрокаДействия.Действие;
		
		МенеджерЗаписи.Действие = СтрокаДействия.Действие;
		МенеджерЗаписи.ПрохождениеМедОсмотра = ПрохождениеМедОсмотра;
		МенеджерЗаписи.Прочитать();
		
		ВручнуюВведеннаяДатаВыполнения = Дата(1,1,1);
		Если Не ЗначениеЗаполнено(СтрокаДействия.Прием) Тогда
			ВручнуюВведеннаяДатаВыполнения = СтрокаДействия.ДатаВыполнения;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВручнуюВведеннаяДатаВыполнения)
			И (СтрокаДействия.Заключение = СтрокаДействия.ЗаключениеПоУмолчанию
				Или ПустаяСтрока(СтрокаДействия.Заключение))
		Тогда
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
			
		ИначеЕсли МенеджерЗаписи.Заключение <> СтрокаДействия.Заключение
			Или МенеджерЗаписи.ДатаВыполнения <> ВручнуюВведеннаяДатаВыполнения
		Тогда
			МенеджерЗаписи.Заключение = СтрокаДействия.Заключение;
			МенеджерЗаписи.Действие = СтрокаДействия.Действие;
			МенеджерЗаписи.ПрохождениеМедОсмотра = ПрохождениеМедОсмотра;
			МенеджерЗаписи.ДатаВыполнения = ВручнуюВведеннаяДатаВыполнения;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДействий(СписокДействий)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокДействий",СписокДействий);
	Запрос.УстановитьПараметр("ПрохождениеМедОсмотра",ПрохождениеМедОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияМедосмотра.Ссылка КАК Действие
		|ПОМЕСТИТЬ СписокДействий
		|ИЗ
		|	Справочник.ДействияМедосмотра КАК ДействияМедосмотра
		|ГДЕ
		|	ДействияМедосмотра.Ссылка В(&СписокДействий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.Заключение КАК Заключение,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.Действие КАК Действие,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.ДатаВыполнения КАК ДатаВыполнения
		|ПОМЕСТИТЬ ЗаключенияПоРегистру
		|ИЗ
		|	РегистрСведений.ЗаключенияПоДействиямМедосмотра КАК ЗаключенияПоДействиямМедосмотраСрезПоследних
		|ГДЕ
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.ПрохождениеМедОсмотра = &ПрохождениеМедОсмотра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДействий.Действие КАК Действие,
		|	ЗаключенияПоРегистру.Заключение КАК Заключение,
		|	ЗаключенияПоРегистру.ДатаВыполнения КАК ДатаВыполнения,
		|	СписокДействий.Действие.ТекстЗаключенияПоУмолчанию КАК ТекстЗаключенияПоУмолчанию
		|ИЗ
		|	СписокДействий КАК СписокДействий
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаключенияПоРегистру КАК ЗаключенияПоРегистру
		|		ПО СписокДействий.Действие = ЗаключенияПоРегистру.Действие
		|
		|УПОРЯДОЧИТЬ ПО
		|	СписокДействий.Действие.Вид УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПрохождениеМедОсмотра);
	
	ДействияМедОсмотра.Очистить();
	ТекстЗаключенияПоУмолчанию	 = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	ТаблицаПараметровИЗначений	 = МедосмотрыСервер.ПолучитьТаблицуДействийМедосмотраИЗначений(ПрохождениеМедОсмотра, СписокДействий);
	ПриемыПоДействиямМедосмотров = МедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПрохождениеМедОсмотра, СписокДействий);
	
	ОтборДействиеМедосмотра = Новый Структура("ДействиеМедосмотра");
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДействияМедОсмотра.Добавить();
		НоваяСтрока.Действие = Выборка.Действие;
		НоваяСтрока.ЗаключениеПоУмолчанию = ?(ЗначениеЗаполнено(Выборка.ТекстЗаключенияПоУмолчанию),Выборка.ТекстЗаключенияПоУмолчанию,ТекстЗаключенияПоУмолчанию);
		
		ОтборДействиеМедосмотра.ДействиеМедосмотра = Выборка.Действие;
		ТаблицаПараметровДействия = ТаблицаПараметровИЗначений.Скопировать(ТаблицаПараметровИЗначений.НайтиСтроки(ОтборДействиеМедосмотра));
		
		СтрокиВредныхФакторов = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие",Выборка.Действие));
		СписокВредныхФакторов = СписокПротивопоказаний.Скопировать(СтрокиВредныхФакторов, "ВредныйФактор").ВыгрузитьКолонку("ВредныйФактор");
		НоваяСтрока.ЗаключениеПоУмолчанию = МедосмотрыСервер.ЗаключениеДляДействияМедОсмотра(СписокВредныхФакторов, НоваяСтрока.ЗаключениеПоУмолчанию, ТаблицаПараметровДействия, Выборка.Действие.Вид);
		
		Если ЗначениеЗаполнено(Выборка.Заключение) Тогда
			НоваяСтрока.Заключение = Выборка.Заключение;
		Иначе
			НоваяСтрока.Заключение = НоваяСтрока.ЗаключениеПоУмолчанию;
		КонецЕсли;
		
		НоваяСтрока.Прием = ПриемыПоДействиямМедосмотров.Получить(НоваяСтрока.Действие);
		Если ЗначениеЗаполнено(НоваяСтрока.Прием) Тогда
			НоваяСтрока.ДатаВыполнения = НоваяСтрока.Прием.Дата;
		Иначе
			НоваяСтрока.ДатаВыполнения = Выборка.ДатаВыполнения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемМодифицированнойФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ЗаписатьИЗакрытьНаСервере(ПрохождениеМедОсмотра, ДействияМедОсмотра);
		Закрыть(Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
